#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_service_discovery_http_namespace.namespace: Refreshing state... [id=ns-cc5i7ykaj67ppst3]
aws_kms_key.custom_kms_key: Refreshing state... [id=d01608ec-6fe5-4e78-985f-73ae43aaeabf]
aws_vpc.this: Refreshing state... [id=vpc-0c25adbecbb690848]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_kms_alias.key: Refreshing state... [id=alias/app-6]
aws_cloudwatch_log_group.logs: Refreshing state... [id=/amazon-ecs/app-6/log]
aws_ecr_repository.image_repo: Refreshing state... [id=app-6]
aws_kms_key_policy.encrypt_app: Refreshing state... [id=d01608ec-6fe5-4e78-985f-73ae43aaeabf]
aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:cluster/app-6]
aws_route_table.this_rt: Refreshing state... [id=rtb-0146905b2ea976fac]
aws_subnet.public[1]: Refreshing state... [id=subnet-0ccd6f12831863744]
aws_subnet.public[0]: Refreshing state... [id=subnet-052b79dcfca7c2da8]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-6/bfd3d4ad324ca04f]
aws_route_table.this_rt_private: Refreshing state... [id=rtb-0d1790cd2e8fc467b]
aws_security_group.endpoint-sg: Refreshing state... [id=sg-05930af064bcda15f]
aws_default_security_group.default: Refreshing state... [id=sg-06e68bd9c87e44033]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-02f0ebcaad8ca09ab]
aws_security_group.custom_sg: Refreshing state... [id=sg-0aa0899fa57a4474f]
aws_subnet.private[1]: Refreshing state... [id=subnet-0b115cd59ccee52cc]
aws_subnet.private[0]: Refreshing state... [id=subnet-00b200da3736480b3]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0881aaa1abff279c3]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0242b8bd7cdbfc57d]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01dd8f540f25af285]
aws_security_group_rule.egress_load_balancer: Refreshing state... [id=sgrule-444283331]
aws_security_group_rule.ingress_vpc_endpoint: Refreshing state... [id=sgrule-2232583338]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-6/75a4b6466f16b98e]
aws_security_group_rule.ingress_load_balancer: Refreshing state... [id=sgrule-2328443206]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-01dcc22686bbd490d]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-080ae5df228a0a3eb]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0162c61432d3d4ff0]
aws_vpc_endpoint.ecr: Refreshing state... [id=vpce-0b59563ce67422eb4]
aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-00a083e0f972936f5]
aws_route.internet_route: Refreshing state... [id=r-rtb-0146905b2ea976fac1080289494]
aws_vpc_endpoint_route_table_association.s3_association: Refreshing state... [id=a-vpce-02f0ebcaad8ca09ab950437006]
aws_alb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-6/75a4b6466f16b98e/1adac489bfe99a5a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.infra_output will be created
  + resource "aws_ssm_parameter" "infra_output" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "d01608ec-6fe5-4e78-985f-73ae43aaeabf"
      + name           = "/app-6/output"
      + tags_all       = {
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*